cases/05_navier_stokes_equation/30_triangular_cavity_piso_Re200_hybrid80/N80/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /    O  peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

// 第五题顶盖驱动腔流的速度初值。
//
//     U(x,y,0) = (0,0,0)
//
// movingTop 顶盖边界：
//
//     U = (1,0,0)
//
// 其余固壁边界：
//
//     U = (0,0,0)
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
    leftWall
    {
        type noSlip;
    }
    rightWall
    {
        type noSlip;
    }
    movingTop
    {
        type fixedValue;
        value uniform (1 0 0);
    }
    front
    {
        type empty;
    }
    back
    {
        type empty;
    }
}
